[
    {
        "label": "Teaching",
        "explanation": "I have picked up a very good style of teaching through the years and having many courses about teaching to improve my style as much as possible."

    },
    {
        "label": "Lab Work",
        "explanation": "As I am working in bushiness too so that I have a very good  experience with helping students with practical work."

    },
    {
        "label": "Supervision",
        "explanation": "I have supervised many students with their BSc graduation project and MSc projects with grate success. Many of them got distinction grades and awards wof their work  "

    },
    {
        "label": "Research",
        "explanation": "I have done many research projects as researches are the most interesting part of the academy life which helps us to solve real life problems."

    },
    {
        "label": "Publication",
        "explanation": "Well publication is not my best suite none the less I have my good share of it as it keeps the research alive and introduce my work to the scientific community."

    },
    {
        "label": "Head of QA",
        "explanation": "I have held the position department's head of Quality assurance for many years. This gave me a great experience with the rules and regulations of the University and enabled me to help other colleagues to develop better research tracks and teaching curriculum for their subjects"

    },
    {
        "label": "Head of Examination Committee",
        "explanation": "For the year 2019-2020 I was the head of Examination Committee at the department of software engineering. I was responsible of exam scheduling coordination between the students, lecturers and other committee members. I also was responsible of publishing exam results and making sure to follow the universities regulations."

    },
    {
        "label": "Member of Disciplinary Committee",
        "explanation": "As a member of this committee, I was responsible of resolving conflicts between students, students and lecturers and deliver the right disciplinary actions against students if needed according to the regulations of the university."

    }
]