[
    {
        "date": "Nov 2023",
        "label": "Kurdistan University",
        "detail": "In this year I have returned to Kurdistan University-Hawler as a part time lecturer with the main goal of establishing an AI and innovation center AIIC."
    },
    {
        "date": "Nov 2021",
        "label": "SmartGate",
        "detail": "I transferred to SmartGate as the Software Development Team Manager. My team has successfully delivered multiple products to date."
    },
    {
        "date": "Nov 2019",
        "label": "InfoRR",
        "detail": "I worked for the InfoRR company as a consultant for software engineering and IT-related issues. The company grew and a subsidiary was established, focusing on IT-related contracts and called SmartGate."
    },
    {
        "date": "Sep 2018",
        "label": "Visiting Lecturer",
        "detail": "This year I had the privilege to become visiting lecturer for two universities namely Kurdistan University and Tishk University"
    },
    {
        "date": "Feb 2018",
        "label": "Lecturer",
        "detail": "After completing my PhD, I returned to Iraq/Kurdistan with my family and began working as a lecturer in the Department of Software Engineering."
    },
    {
        "date": "Oct 2017",
        "label": "PhD Graduate",
        "detail": "This time my defense was more pleasing and easier than MSc! The committee was really happy with the results."
    },
    {
        "date": "Oct 2012",
        "label": "Accepted in PhD",
        "detail": "I had been accepted to pursue my PhD at Nottingham University's School of Computer Science, under the Twanasazi scholarship from the KRG. My supervisor was Dr Uwe, and I  worked on Time Series Classification."
    },
    {
        "date": "Aug 2010",
        "label": "Entersol Co-founder",
        "detail": "I was the primary founder of the company that successfully developed multiple applications and provided services. However, I decided to close the company in order to complete my PhD."
    },
    {
        "date": "Mar 2010",
        "label": "IT Training",
        "detail": "I received a DAAD grant to travel to Germany for IT infrastructure training. I studied at Berlin University's School of Computer Science."
    },
    {
        "date": "Sep 2009",
        "label": "Assistant Lecturer",
        "detail": "After graduation, I resumed my job at Salahaddin University as an assistant lecturer in the Department of Electrical Engineering. My responsibilities included teaching programming subjects."
    },
    {
        "date": "Jul 2009",
        "label": "MSc Graduate",
        "detail": "I have had completed my MSc with some disappointment, as I encountered a challenging thesis defense. Unfortunately, one of the committee members seemed to be working against me, which made the experience even more difficult"
    },
    {
        "date": "Mar 2008",
        "label": "AwroSoft Co-founder",
        "detail": "Me and some other friends has established a company for software engineering services, we had multiple products, however I have withdraw from it so I can finish my masters degree."
    },
    {
        "date": "Oct 2007",
        "label": "Accepted in MSc",
        "detail": "I have been accepted into the Master of Science program in the Department of Electrical Engineering, within the discipline of Electrical and Information Technology Studies."
    },
    {
        "date": "Feb 2005",
        "label": "Employed as Engineer",
        "detail": "I get the employment opportunity at my university due to my outstanding degree and rank"
    },
    {
        "date": "Jul 2004",
        "label": "Graduation",
        "detail": "I graduated with a degree of 76.3, which was considered a highly impressive achievement at the time. My performance was second-best among all engineering students in the university."
    },
    {
        "date": "Oct 2000",
        "label": "Software Engineering",
        "detail": "It was a dream come true. I really loved the discipline, as I was accepted into the Department of Software Engineering at Salahaddin University-Erbil"
    },
    {
        "date": "Jul 1996",
        "label": "Secondary School",
        "detail": "Kurdistan Secondary School was a dream come true, offering the best education in the region. I learned a lot of subjects deeply, including coding, which was only taught there."
    },
    {
        "date": "Jul 1992",
        "label": "Intermediate School",
        "detail": "Intermediate school (Qandil)was difficult for me due to the civil war and a change in study system from Arabic to Kurdish. It was also a challenging time because I was going through my teenage years."
    },
    {
        "date": "Jul 1986",
        "label": "1st Day in School",
        "detail": "I attended 17 Tamooz Primary School in Erbil, which was one of the best schools in the city. I will always be grateful to my great teachers, especially Mrs. Narmin, who taught me to love reading books."
    },
    {
        "date": "Sep 1981",
        "label": "My Birth Day",
        "detail": "I was born in the city of Erbil, Iraq. My father, Abdulhamid Fattah, is a biologist and my mother, Samira Bilal, is a teacher. I am the first child in the family and we have grown to a family of six members with two brothers, and a sister."
    }
]